

LEXICON_RU: dict = {
    '/start': 'Привет! Это бот который поможет тебе выбрать отель. Теперь тебе нужно выбрать действие: ',
    'lowprice': 'Топ низких цен',
    'highprice': 'Топ высоких цен',
    'bestdeal': 'Лучшие предложения',
    'history': 'История поиска',
    'lowprice_greetings': '⬇️Вы выбрали режим поиска самых дешевых отелей в городе. Мы покажем вам'
                          'топ <b>самых дешевых отелей</b> города на ваши даты',
    'highprice_greetings': '⬆️Вы выбрали режим поиска самых дорогих отелей в городе. Мы покажем вам '
                           'топ  <b>самых дорогих отелей</b> города на ваши даты ',
    'bestdeal_greetings': '🤌 Вы выбрали режим поиска <b>лучших предложений</b>. Мы подберем лучшие'
                          ' предложения в вашем диапазоне цен и расстояний до центра.',
    'enter_city': 'В каком городе Вы хотите найди отели?',
    'cancel': 'Отменить выбор  ❌',
    'city_name_ok': ' Выбран город: ',
    'city_name_wrong': 'Неверное название. Попробуйте еще раз',
    'enter_hotel_count': 'Введите кол-во отелей, которое вы хотели бы увидеть в результате',
    'photo': 'Хотите посмотреть фотографии отелей?',
    'yes': 'Да',
    'no': 'Нет',
    'hotels_count_wrong': 'Пожалуйста обозначьте кол-во отелей числом',
    'get_photo_wrong': 'Пожалуйста нажмите кнопку ДА или НЕТ',
    'photo_count': 'Пожалуйста введите кол-во фотографий',
    'one': '1️⃣',
    'two': '2️⃣',
    'three': '3️⃣',
    'four': '4️⃣',
    'five': '5️⃣',
    'six': '6️⃣',
    'seven': '7️⃣',
    'eight': '8️⃣',
    'nine': '9️⃣',
    'ten': '🔟',
    'checkIn': 'Пожалуйста введите дату заселения',
    'checkOut': 'Пожалуйста введите дату выезда',
    'wrong_photo_count': 'Пожалуйста воспользуйтесь кнопками',
    'wrong_date': 'Пожалуйста проверьте формат даты <b>ДД.ММ.ГГГГ</b>. \nДата не должна быть меньше текущей',
    'enter_adults': 'Сколько гостей?',
    'wrong_adults': 'Пожалуйста, воспользуйтесь кнопками выбора',
    'index': '-й вариант',
    'hotel': '🛏  Отель',
    'distance_to_dt': '🚘 Расстояние до центра: ',
    'price_per_night': '💵 Стоимость за ночь',
    'total_price': '💵 Стоимость за период',
    'photos': '📷 Фотографии: ',
    'results_wait': 'Вывод результатов ⌛...',
    'distance_choiсe': 'Выберете диапазон расстояний до центра города:',
    'first_dist': '0 - 1 км',
    'second_dist': '1 - 3 км',
    'third_dist': '3 - 5 км',
    'fourth_dist': 'более 5 км',
    'price_choiсe': 'Выберете диапазон цен за ночь:',
    'first_price': '0 - 100 $',
    'second_price': '100 - 200 $',
    'third_price': '200 - 300 $',
    'fourth_price': 'от 300 $',
    'wrong_distance': 'Неверный формат диапазона расстояний. Пожалуйста, воспользуйтесь кнопками выбора.',
    'wronп_price:': 'Неверный формат цены. Пожалуйста, воспользуйтесь кнопками выбора.',
    'nothing_bestdeal': 'В выбранном диапазоне цен и расстояний ничего не найдено. Попробуйте еще раз',
    'again': 'Начать поиск заново?',
    'not_again': 'Хорошо. Когда будете готовы воспользоваться нашим сервисом, нажмите введите команды /start',
    'wrong_choice': 'Пожалуйста, воспользуйтесь кнопками',
    '/help': 'Справка по работе бота',
    '/lowprice': 'Топ предложений с самой низкой ценой',
    '/highprice': 'Топ предложений с самой высокой ценой',
    '/history': 'Показать мою историю запросов',
    'help_command': '<b>Топ низких цен</b> покажет вам найти самые дешевые отели\n'
                    '<b>Топ высоких цен</b> покажет вам самые дорогие отели города\n'
                    '<b>Лучшие предложения</b> покажет вам подходящие отели в вашем диапазоне цен и расстояний до цента\n'
                    '<b>/history</b> покажет вам историю последних 10 запросов\n'
                    'Для начала работы воспользуйтесь командой <b>/start</b>'


}

LEXICON: dict = LEXICON_RU